# 试剂、菌株 {#materials}

## 主要试剂

| 试剂名称            | 保存方法      | 浓度/纯度         | 生产厂家          | 主要用途     |
|-----------------|-----------|---------------|---------------|----------|
|  LB肉汤           | 室温        |  BR           | 青岛海博生物技术有限公司  | 培养细菌     |
| Agar琼脂          | 室温        |  BR           | 北京酷来搏科技有限公司   | 凝固剂      |
| 20×PBS磷酸盐缓冲液    | 室温        |  BR           | 上海源叶生物科技有限公司  | 缓冲溶液     |
| 无水乙醇            | 室温        | 消毒            |               |          |
| 甘油              | 室温        | 上海源叶生物科技有限公司  | 细菌防冻          |          |
| 葡萄糖             | 室温        | Sigma-Aldrich | 微生物营养物        |          |
| 乙酸钠             | 室温        | Sigma-Aldrich | 微生物营养物        |          |
| 盐酸四环素 (Tet)     | -20 °C    | 900 μg/mg     | 上海源叶生物科技有限公司  |  抗生素     |
| 硫酸链霉素 (Sul)     | 2-6 °C    | 上海源叶生物科技有限公司  |  抗生素          |          |
| 卡纳硫酸 (Kan)      | 2-6 °C    | 上海源叶生物科技有限公司  |  抗生素          |          |
| 氨苄青霉素 (Amp)     | 2-6 °C    | 上海源叶生物科技有限公司  |  抗生素          |          |
| 碘化丙啶PI染色液       | 避光 -20 °C | 1 mg/mL       | 北京雷根生物技术有限公司  | 细胞膜通透性测定 |
| 2',7'-二氯荧光素二乙酸酯 | 避光 -20 °C | ≥ 97%         | Sigma-Aldrich | 活性氧产量测定  |
| 次氯酸钠            | 2-6 °C    | 上海源叶生物科技有限公司  | 消毒            |          |
|  待补充            |           |               |               |          |
|  待补充            |           |               |               |          |
|  待补充            |           |               |               |          |
|  待补充            |           |               |               |          |
|  待补充            |           |               |               |          |



## 主要菌株

| 名称                                          | 保存方法      | 主要用途    | 购买厂家 |
|---------------------------------------------|-----------|---------|------|
| Escherichia coli str. K-12 substr. MG1655   | -20\-80°C | 突变      |      |
| Escherichia coli HB101                      | -20\-80°C | 接合转移    |      |
| Escherichia coli HB101 with Plasmid RP4     | -20\-80°C | 杀菌、接合转移 |      |
| Escherichia coli HB101 with Plasmid PWH1266 | -20\-80°C | 转化      |      |

